ХамелионЦРПТ/src/DataProcessors/СоздатьОпределенноеКоличествоЗаказовИОтправитьВЦРПТ/СоздатьОпределенноеКоличествоЗаказовИОтправитьВЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СоздатьОпределенноеКоличествоЗаказовИОтправитьВЦРПТ</name>
  <attributes>
    <name>КоличествоЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьЗаказов</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ХамелионЦРПТ/src/Enums/ТипыДокументаВводВОборот_ХамелеонЦРПТ/ТипыДокументаВводВОборот_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДокументаВводВОборот_ХамелеонЦРПТ</name>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотИмпорт</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотКонтракт</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОбИспользовании</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборотВозвратВРозницу</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОБоротаДляСобственныхНужд</name>
  </enumValues>
  <enumValues>
    <name>ВводВоборотТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>НаТерриторииСтранЕАЭСКонтрактноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ИмпортСФТС</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/СпособВыпускаТоваров_ХамелеонЦРПТ/СпособВыпускаТоваров_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособВыпускаТоваров_ХамелеонЦРПТ</name>
  <enumValues>
    <name>ПроизведенВРФ</name>
  </enumValues>
  <enumValues>
    <name>ВвезенВРФ</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/ТипПродукции_ХамелеонЦРПТ/ТипПродукции_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипПродукции_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Молоко</name>
  </enumValues>
  <enumValues>
    <name>Фото</name>
  </enumValues>
  <enumValues>
    <name>Свет</name>
  </enumValues>
  <enumValues>
    <name>Табак</name>
  </enumValues>
  <enumValues>
    <name>Фармацевтика</name>
  </enumValues>
  <enumValues>
    <name>Парфюм</name>
  </enumValues>
  <enumValues>
    <name>Одежда</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>ПитьеваяВода</name>
  </enumValues>
  <enumValues>
    <name>Белье</name>
  </enumValues>
  <enumValues>
    <name>Рамы</name>
  </enumValues>
  <enumValues>
    <name>КреслаКоляски</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>Пиво</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/ВидМаркировки_ХамелеонЦРПТ/ВидМаркировки_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидМаркировки_ХамелеонЦРПТ</name>
  <enumValues>
    <name>НаПотребительскуюУпаковку</name>
  </enumValues>
  <enumValues>
    <name>НаТовар</name>
  </enumValues>
  <enumValues>
    <name>НаТоварныйЯрлык</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/ТипКодаМаркировки_ХамелеонЦРПТ/ТипКодаМаркировки_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипКодаМаркировки_ХамелеонЦРПТ</name>
  <enumValues>
    <name>UNIT</name>
  </enumValues>
  <enumValues>
    <name>BUNDLE</name>
  </enumValues>
  <enumValues>
    <name>SET</name>
  </enumValues>
  <enumValues>
    <name>GROUP</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/СпособФормированияСН_ХамелеонЦРПТ/СпособФормированияСН_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособФормированияСН_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Самостоятельно</name>
  </enumValues>
  <enumValues>
    <name>ОператорИСМП</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Documents/ЗаказМарок_ХамелеонЦРПТ/ЗаказМарок_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказМарок_ХамелеонЦРПТ</name>
  <basedOn>Document.GS1_Обувь_ХамелеонЦРПТ</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиКМЭмитированые_ХамелеонЦРПТ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументов_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>_Order_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводВОборот</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОтправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораСОператором</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораСОператором</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособИзготовленияСИ</name>
    <type>
      <types>EnumRef.СпособИзготовленияСИ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикеток_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Оригинал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СледующийДокумент</name>
    <type>
      <types>DocumentRef.ЗаказМарок_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННЦЭМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЦЭМ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДогоораСЦЭМ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораСЦЭМ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоКоличествоКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогКоличествоПолучено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукции</name>
    <type>
      <types>EnumRef.ТипПродукции_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СУЗОбувь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипОплаты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыпускаТоваров</name>
    <type>
      <types>EnumRef.СпособВыпускаТоваров_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКМ</name>
    <type>
      <types>EnumRef.Шаблоны_подписи_кодов_КМ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КМНеПодлежитОплате</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКМ_Табак</name>
    <type>
      <types>EnumRef.Шаблоны_подписи_кодов_КМ_Табак_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварПроизведенПриобретенДо1032020</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварВвезенВРФПосле1032020</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВвестиВОборотПослеЭмитирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтчетОбИспользовании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисПровайдер</name>
    <type>
      <types>CatalogRef.ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>МВ_Интегратор</name>
    <type>
      <types>CatalogRef.МВ_Интеграторы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяПродукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Обрабатывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>CatalogRef.КодТНВЭД_ХамелеонЦРПТ</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыпускаТоваров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособФормированияСН</name>
      <type>
        <types>EnumRef.СпособФормированияСН_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСИ</name>
      <type>
        <types>EnumRef.ВидСИ_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМаркировки</name>
      <type>
        <types>EnumRef.ВидМаркировки_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСтроки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПолучено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоследнийБлок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОшибкаПолучения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоденДо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСУЗ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитДляСопотавления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВСД</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипКодаМаркировки</name>
      <type>
        <types>EnumRef.ТипКодаМаркировки_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоЧаса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКороба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПаллет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>cis</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КМИзAPI</name>
    <attributes>
      <name>Order_Id_Line</name>
      <type>
        <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКМ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерКМ_Короткий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОшибкиПолучения</name>
    <attributes>
      <name>Ошибка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодОшибки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ХамелионЦРПТ/src/DataProcessors/СоздатьОпределенноеКоличествоЗаказовИОтправитьВЦРПТ/Forms/Форма/Module.bsl
Функция ПолучитьИзПользователя()
	Возврат обработки._Запуск_ХамелеонЦРПТ.ПолучитьИзПользователя(Объект.ТекущийПользователь);
Конецфункции
	

&НаКлиенте
Функция МассивЗаказовДляПолучения()

	МассивЗаказов=Новый Массив;
	Thumbprint_1=ПолучитьИзПользователя();
			ПараметрыДлякилента=Thumbprint_1;
				АдресРаздробить=ПараметрыДлякилента.АдресСУЗ;
				Адрес=Сред(АдресРаздробить,Найти(АдресРаздробить,"://")+3);
				Адрес=Сред(Адрес,1,Найти(Адрес,":")-1);
				Порт=Сред(АдресРаздробить,Найти(АдресРаздробить,"://")+3);
				Порт=Сред(Порт,Найти(Порт,":")+1);
				Попытка
					Порт=число(Порт);
				Исключение
					Порт=Неопределено;
				КонецПопытки;
				
		Если Не ЗначениеЗаполнено(Адрес) Тогда
			
			ПоказатьПредупреждение(,"В пользователе не заполнен адрес СУЗ");
			Возврат МассивЗаказов;
			
		КонецЕсли;
		
			Если Найти(АдресРаздробить,"https")=1 Тогда
				Защищ=Новый ЗащищенноеСоединениеopenSSL();
			Иначе
				Защищ=Неопределено;
			КонецЕсли;
		
			Срегистра="";
			СерийныйНомер="";
	  	Куки=ОбщиеМетоды_НаКлиенте_ХамелеонЦРПТ.ПолучитькукиВСУЗ(Thumbprint_1,,Срегистра,СерийныйНомер);
			
		Если Не ЗначениеЗаполнено(Куки) 
			ИЛИ Не ЗначениеЗаполнено(Срегистра) ИЛИ Не ЗначениеЗаполнено(СерийныйНомер) 
			Тогда
			
		//	ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаписатьТокенВРегистр(Thumbprint_1.Thumbprint_1,"");
		//	Если УжеОтправили<>Истина Тогда
		//		 ПолучитьТокенИИД(Команда,Истина)
		//	КонецЕсли;
			Возврат МассивЗаказов;
			
		КонецЕсли;




		Если Ложь Тогда
		//		Если НЕ ЗагрузканаСервереПолучитьКМИзФЗШ_Шины(ПараметрыДлякилента,Адрес,Порт,Защищ) Тогда
		//					ПоказатьПредупреждение(,"Не удалось подключиться к СУЗ");
		//	
		//		КонецЕсли;
				
				
			Иначе
				
					Если ЗначениеЗАполнено(ПараметрыДлякилента.АдресПрокси) Тогда
						Прокси=Новый ИнтернетПрокси;
						Прокси.Установить("http",ПараметрыДлякилента.АдресПрокси,ПараметрыДлякилента.ПортПрокси,ПараметрыДлякилента.ПользовательПрокси,ПараметрыДлякилента.ПарольПрокси);
					
						HTTPСервисЗапрос=Новый HTTPСоединение(Адрес,Порт,,,Прокси,,Защищ);
					Иначе
						HTTPСервисЗапрос=Новый HTTPСоединение(Адрес,Порт,,,,,Защищ);
					КонецЕсли;
					
											//Если ОБъект.СУЗОбувь Тогда
											
											
											
//								HTTPЗапрос = Новый HTTPЗапрос("api/v2/"+ПараметрыДлякилента.СайтКСУЗ+"/codes?orderId="+Объект._Order_ID+"&gtin="+ПолучитьGTIN(Стр.GTIN)+"&quantity="+
//								Формат(Получить,"ЧГ=")+"&lastBlockId="+Строка(Стр.ПоследнийБлок)+"&omsId="+ПараметрыДлякилента.ИдентификаторСУЗ);
							//Иначе
							//	HTTPЗапрос = Новый HTTPЗапрос("api/v2/"+ПараметрыДлякилента.СайтКСУЗ+"/codes?orderId="+Стр.ИДСУЗ+"&gtin="+ПолучитьGTIN(Стр.GTIN)+"&quantity="+
							//	Формат(Получить,"ЧГ=")+"&lastBlockId="+Строка(Стр.ПоследнийБлок)+"&omsId="+ПараметрыДлякилента.ИдентификаторСУЗ);
								
							//КонецЕслИ;
							
							
							
							
							
							
							//ИдентификаторСУЗ=ОбщиеМетоды_НаКлиенте_ХамелеонЦРПТ.ПодключениеКСУЗ_ХамелеонЦРПТ(ПараметрыДлякилента);
							 // HTTPЗапрос = Новый HTTPЗапрос("api/v2/"+ПараметрыДлякилxента.СайтКСУЗ+"/orders?omsId="+ПараметрыДлякилента.ИдентификаторСУЗ);
							 
							 СайтКСУЗ=Врег(ПараметрыДлякилента.СайтКСУЗ);
							 Если    СайтКСУЗ="LP" Тогда
								 СайтКСУЗ="LIGHT"
							Конецесли;
							 
							 HTTPЗапрос = Новый HTTPЗапрос("webapi/v1/orders?limit=100&skip=0&productGroup="+СайтКСУЗ);
							 

							 
							 
							 ТокенСУЗ=ОбщиеМетоды_НаКлиенте_ХамелеонЦРПТ.ПодключениеКСУЗ_ХамелеонЦРПТ(ПараметрыДлякилента);
							
								HTTPЗапрос.Заголовки.Вставить("Content-Type","application/x-www-form-urlencoded;charset=UTF-8");
								HTTPЗапрос.Заголовки.Вставить("clientToken",ТокенСУЗ);
								HTTPЗапрос.Заголовки.Вставить("Cookie",Куки);
								
								Попытка
									Ответ=HTTPСервисЗапрос.Получить(HTTPЗапрос);
								Исключение
									Возврат МассивЗаказов;
								КонецПопытки;
								ТекстДокумента=Ответ.ПолучитьТелоКакСтроку();
								
								NNNN=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаполнитьСтруктуруИзОтветаJSON(ТекстДокумента);
								
								orderSummaryInfos="";
								Если NNNN.Свойство("orderSummaryInfos",orderSummaryInfos) Тогда
									Для Каждого Стр Из orderSummaryInfos  Цикл
										HTTPЗапрос = Новый HTTPЗапрос("webapi/v1/orders/"+Стр.orderid); //"static/1555676332000/js/main/preload.js");
										HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
										HTTPЗапрос.Заголовки.Вставить("Cookie",Куки);
										
											
										Ответ=HTTPСервисЗапрос.Получить(HTTPЗапрос);
										Текст1=Ответ.ПолучитьТелоКакСтроку();
										
										NNN_1=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаполнитьСтруктуруИзОтветаJSON(СтрЗАменить(Текст1,"@class","class"));
										
										
										HTTPЗапрос = Новый HTTPЗапрос("webapi/v1/orders/"+Стр.orderid+"/buffer"); //"static/1555676332000/js/main/preload.js");
										HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json;charset=UTF-8");
										HTTPЗапрос.Заголовки.Вставить("Cookie",Куки);
										
											
										Ответ=HTTPСервисЗапрос.Получить(HTTPЗапрос);
										Текст1=Ответ.ПолучитьТелоКакСтроку();
										
										NNN_2=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.ЗаполнитьСтруктуруИзОтветаJSON(СтрЗАменить(Текст1,"@class","class"));
										
										
										ДД=ОбщийМодуль_НаСервере_ХамелеонЦРПТ.СоздатьДокументНасервере(NNN_2,NNN_1);
										Если ЗначениеЗаполнено(ДД) Тогда
											МассивЗаказов.Добавить(ДД);
										Конецесли;

									//	Возврат;
										
								Конеццикла;
							Конецесли;
									
								
								
			КонецЕсли;		
	
			Возврат МассивЗаказов
			//ыКонецЕсли;	
КонецФункции


Функция СоздатьЗаказы_1(Сколько,Сч_1)
	
	МассивЗаказов=Новый Массив;
	Для Сч=1 По Сколько Цикл
		Сч_1=Сч_1+1;
		СоздатьЗаказ=Документы.ЗаказМарок_ХамелеонЦРПТ.СоздатьДокумент();
		СоздатьЗаказ.Дата=Текущаядата();
		СоздатьЗаказ.ТекущийПользователь=Объект.ТекущийПользователь;
		если СоздатьЗаказ.ТекущийПользователь.ТипВводаВОборот=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.МаркировкаОстатков Тогда
			СоздатьЗаказ.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.МаркировкаОстатков;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.ТипВводаВОборот=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборотИмпорт 
			ИЛИ СоздатьЗаказ.ТекущийПользователь.ТипВводаВОборот=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ИмпортСФТС
			Тогда
			СоздатьЗаказ.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ВвезенВРФ;
		Иначе
			СоздатьЗаказ.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ПроизведенВРФ
		КонецЕсли;
		
		СоздатьЗаказ.Организация=СоздатьЗаказ.ТекущийПользователь.Организация;
		СоздатьЗаказ.ШаблонКМ=СоздатьЗаказ.ТекущийПользователь.ШаблонКМПоУмолчанию;
		СоздатьЗаказ.ШаблонКМ_Табак=СоздатьЗаказ.ТекущийПользователь.ШаблонКМТабакПоУмолчанию;
		СоздатьЗаказ.ТипОплаты=СоздатьЗаказ.ТекущийПользователь.ТипОплаты;
		Если Не ЗначениеЗаполнено(СоздатьЗаказ.ШаблонЭтикетки) Тогда
			СоздатьЗаказ.ШаблонЭтикетки=СоздатьЗаказ.ТекущийПользователь.ШаблонЭтикетки;
		КонецЕсли;
		Если Не ЗначениеЗАполнено(СоздатьЗаказ.НомерДоговораСОператором) ТОгда
			СоздатьЗаказ.НомерДоговораСОператором=СоздатьЗаказ.ТекущийПользователь.НомерДоговораСОператором;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СоздатьЗаказ.ДатаДоговораСОператором) Тогда
			СоздатьЗаказ.ДатаДоговораСОператором=СоздатьЗаказ.ТекущийПользователь.ДатаДоговораСОператором;
		КонецЕсли;
		Если не ЗначениеЗаполнено(СоздатьЗаказ.ШаблонЭтикетки) тогда
			СоздатьЗаказ.ШаблонЭтикетки=СоздатьЗаказ.ТекущийПользователь.ШаблонЭтикетки;
		КонецЕсли;
		Для Каждого Стр Из СоздатьЗаказ.Товары Цикл
			Если Не ЗначениеЗаполнено(Стр.СпособФормированияСН) Тогда
				Стр.СпособФормированияСН=СоздатьЗаказ.ТекущийПользователь.СпособФормированияСН;
				
			КонецЕслИ;
			Если Не ЗначениеЗаполнено(Стр.ВидСИ) Тогда
				Стр.ВидСИ=СоздатьЗаказ.ТекущийПользователь.ВидСИ;
				
			КонецЕслИ;
			Если Не ЗначениеЗаполнено(Стр.ВидМаркировки) Тогда
				Стр.ВидМаркировки=СоздатьЗаказ.ТекущийПользователь.ВидМаркировки;
			КонецЕслИ;
		Конеццикла;
		Если СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Шины" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Шины;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Молоко;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Одежда" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Одежда;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Фармацевтика;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Фото;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Парфюм" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Парфюм;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Велосипеды" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Велосипеды;
			
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Питьевая вода" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.ПитьеваяВода;
			
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Кресла-коляски" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.КреслаКоляски;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Пиво" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Пиво;
			
		Иначе
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Обувь
		КонецЕсли;
		
		Для Каждого Стр_1 Из Объект.ТабличнаяЧастьЗаказов Цикл
			Добав=СоздатьЗаказ.Товары.Добавить();
			Добав.GTIN=Стр_1.Продукция;
			Добав.КоличествоКМ=Стр_1.КоличествоКМ;
			
			Добав.ВидМаркировки=Перечисления.ВидМаркировки_ХамелеонЦРПТ.НаТовар;
			Добав.ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
			Добав.СпособФормированияСН=Перечисления.СпособФормированияСН_ХамелеонЦРПТ.ОператорИСМП;
		Конеццикла;
		
		СоздатьЗаказ.Записать();
		МассивЗаказов.Добавить(СоздатьЗаказ.Ссылка);
	Конеццикла;
	
	Возврат МассивЗаказов
	
КонецФункции


&НаКлиенте
Процедура СоздатьИОтправить(Команда)
	сч=0;
	
	Пока Сч<=Объект.КоличествоЗаказов Цикл
	
	
		/////1. Получаем с СУЗ все заказы
		МассивЗаказовДляПолучения=МассивЗаказовДляПолучения();
		/////2. Делаем приемку этих закзаов
		Для Каждого Стр_1 Из МассивЗаказовДляПолучения Цикл
			Форм=ПолучитьФорму("Документ.ЗаказМарок_ХамелеонЦРПТ.Форма.ФормаДокумента",Новый Структура(
			"Ключ",Стр_1));
			Форм.ПолучитьКМИзAPI(Команда);
		Конеццикла;
		МассивЗаказовДляПолучения=МассивЗаказовДляПолучения();
		Если МассивЗаказовДляПолучения.Количество()<10 Тогда
			МассивДляОтправки=СоздатьЗаказы_1(10-МассивЗаказовДляПолучения.Количество(),Сч);
			Для Каждого Стр_11 Из МассивДляОтправки Цикл
				Форм=ПолучитьФорму("Документ.ЗаказМарок_ХамелеонЦРПТ.Форма.ФормаДокумента",
				Новый Структура("Ключ",Стр_11));
				Форм.ОтправитьВЦРПТ(Команда);
			Конеццикла;
		Конецесли;
		
	Конеццикла;
	
	
	Возврат;
	
	// Вставить содержимое обработчика.
	Если Не ЗначениеЗаполнено(Объект.КоличествоЗаказов) 
		ИЛИ Объект.ТабличнаяЧастьЗаказов.Количество()=0
		ИЛИ Не ЗначениеЗаполнено(Объект.ТекущийПользователь) Тогда
		Возврат;
	Конецесли;
	
	Счечт=0;
	Пока Счечт<=Объект.КоличествоЗаказов Цикл
		
		МассивДляОтправки=СоздатьЗаказы();
		
		Для Каждого Стр_11 Из МассивДляОтправки Цикл
			Форм=ПолучитьФорму("Документ.ЗаказМарок_ХамелеонЦРПТ.Форма.ФормаДокумента",
			Новый Структура("Ключ",Стр_11));
			Форм.ОтправитьВЦРПТ(Команда);
		Конеццикла;
	Конеццикла;
КонецПроцедуры


Функция СоздатьЗаказы()
	
	МассивЗаказов=Новый Массив;
	Для Сч=1 По Объект.КоличествоЗаказов Цикл
		СоздатьЗаказ=Документы.ЗаказМарок_ХамелеонЦРПТ.СоздатьДокумент();
		СоздатьЗаказ.Дата=Текущаядата();
		СоздатьЗаказ.ТекущийПользователь=Объект.ТекущийПользователь;
		если СоздатьЗаказ.ТекущийПользователь.ТипВводаВОборот=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.МаркировкаОстатков Тогда
			СоздатьЗаказ.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.МаркировкаОстатков;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.ТипВводаВОборот=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ВводВОборотИмпорт 
			ИЛИ СоздатьЗаказ.ТекущийПользователь.ТипВводаВОборот=Перечисления.ТипыДокументаВводВОборот_ХамелеонЦРПТ.ИмпортСФТС
			Тогда
			СоздатьЗаказ.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ВвезенВРФ;
		Иначе
			СоздатьЗаказ.СпособВыпускаТоваров=Перечисления.СпособВыпускаТоваров_ХамелеонЦРПТ.ПроизведенВРФ
		КонецЕсли;
		
		СоздатьЗаказ.Организация=СоздатьЗаказ.ТекущийПользователь.Организация;
		СоздатьЗаказ.ШаблонКМ=СоздатьЗаказ.ТекущийПользователь.ШаблонКМПоУмолчанию;
		СоздатьЗаказ.ШаблонКМ_Табак=СоздатьЗаказ.ТекущийПользователь.ШаблонКМТабакПоУмолчанию;
		СоздатьЗаказ.ТипОплаты=СоздатьЗаказ.ТекущийПользователь.ТипОплаты;
		Если Не ЗначениеЗаполнено(СоздатьЗаказ.ШаблонЭтикетки) Тогда
			СоздатьЗаказ.ШаблонЭтикетки=СоздатьЗаказ.ТекущийПользователь.ШаблонЭтикетки;
		КонецЕсли;
		Если Не ЗначениеЗАполнено(СоздатьЗаказ.НомерДоговораСОператором) ТОгда
			СоздатьЗаказ.НомерДоговораСОператором=СоздатьЗаказ.ТекущийПользователь.НомерДоговораСОператором;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СоздатьЗаказ.ДатаДоговораСОператором) Тогда
			СоздатьЗаказ.ДатаДоговораСОператором=СоздатьЗаказ.ТекущийПользователь.ДатаДоговораСОператором;
		КонецЕсли;
		Если не ЗначениеЗаполнено(СоздатьЗаказ.ШаблонЭтикетки) тогда
			СоздатьЗаказ.ШаблонЭтикетки=СоздатьЗаказ.ТекущийПользователь.ШаблонЭтикетки;
		КонецЕсли;
		Для Каждого Стр Из СоздатьЗаказ.Товары Цикл
			Если Не ЗначениеЗаполнено(Стр.СпособФормированияСН) Тогда
				Стр.СпособФормированияСН=СоздатьЗаказ.ТекущийПользователь.СпособФормированияСН;
				
			КонецЕслИ;
			Если Не ЗначениеЗаполнено(Стр.ВидСИ) Тогда
				Стр.ВидСИ=СоздатьЗаказ.ТекущийПользователь.ВидСИ;
				
			КонецЕслИ;
			Если Не ЗначениеЗаполнено(Стр.ВидМаркировки) Тогда
				Стр.ВидМаркировки=СоздатьЗаказ.ТекущийПользователь.ВидМаркировки;
			КонецЕслИ;
		Конеццикла;
		Если СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Шины" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Шины;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Молоко" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Молоко;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Одежда" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Одежда;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Табак" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Табак;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Альтернативный табак" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.АльтернативныйТабак;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фармацевтика" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Фармацевтика;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Фото" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Фото;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Парфюм" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Парфюм;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Велосипеды" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Велосипеды;
			
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Питьевая вода" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.ПитьеваяВода;
			
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Кресла-коляски" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.КреслаКоляски;
		ИначеЕсли СоздатьЗаказ.ТекущийПользователь.СайтыВходаВСистему.Наименование="Пиво" Тогда
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Пиво;
			
		Иначе
			СоздатьЗаказ.ТипПродукции=Перечисления.ТипПродукции_ХамелеонЦРПТ.Обувь
		КонецЕсли;
		
		Для Каждого Стр_1 Из Объект.ТабличнаяЧастьЗаказов Цикл
			Добав=СоздатьЗаказ.Товары.Добавить();
			Добав.GTIN=Стр_1.Продукция;
			Добав.КоличествоКМ=Стр_1.КоличествоКМ;
			
			Добав.ВидМаркировки=Перечисления.ВидМаркировки_ХамелеонЦРПТ.НаТовар;
			Добав.ТипКодаМаркировки=Перечисления.ТипКодаМаркировки_ХамелеонЦРПТ.UNIT;
			Добав.СпособФормированияСН=Перечисления.СпособФормированияСН_ХамелеонЦРПТ.ОператорИСМП;
		Конеццикла;
		
		СоздатьЗаказ.Записать();
		МассивЗаказов.Добавить(СоздатьЗаказ.Ссылка);
	Конеццикла;
	
	Возврат МассивЗаказов
	
КонецФункции


&НаКлиенте
Процедура ДополучитьКМ(Команда)
	
	Пока Истина Цикл
		МассивЗаказовДляПолучения=МассивЗаказовДляПолучения();
		Если МассивЗаказовДляПолучения.Количество()=0 Тогда
			Возврат;
		Конецесли;
		
		/////2. Делаем приемку этих закзаов
		Для Каждого Стр_1 Из МассивЗаказовДляПолучения Цикл
			Форм=ПолучитьФорму("Документ.ЗаказМарок_ХамелеонЦРПТ.Форма.ФормаДокумента",Новый Структура(
			"Ключ",Стр_1));
			Форм.ПолучитьКМИзAPI(Команда);
		Конеццикла;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	Форм=ПолучитьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.Форма");
	Открыта=Ложь;
	
	Если НЕ Форм.Открыта() ТОгда
		Форм.Открыть();
		Открыта=Истина;
	Конецесли;
	
	ТекущийПользователь=Форм.Пользователь;
	Если Открыта=Истина Тогда
		Форм.Закрыть();
		
	Конецесли;
	
КонецПроцедуры
